Конфигурация/InformationRegisters/ХранилищеЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеЗначений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ХранилищеЗначений/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяОбъектаКИД = "_КонтрольИнвестиционныхДеклараций";
	
	Если Запись.Источник = ИмяОбъектаКИД Тогда
	
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ХранилищеЗначений.Идентификатор КАК Идентификатор
			|ИЗ
			|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
			|ГДЕ
			|	ХранилищеЗначений.Идентификатор = &Идентификатор
			|	И ХранилищеЗначений.Источник = &ИмяОбъектаКИД";
			
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Идентификатор", Параметры.Ключ.Идентификатор);
		Запрос.УстановитьПараметр("ИмяОбъектаКИД", ИмяОбъектаКИД);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ВнешняяОбработкаКИД = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта(ИмяОбъектаКИД);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяОбъектаКИД = "_КонтрольИнвестиционныхДеклараций";
	
	Если Запись.Источник = ИмяОбъектаКИД Тогда
	
		Отказ = Истина;
		
		ПолноеИмяОбъекта = "ВнешняяОбработка." + ИмяОбъектаКИД;
		ТекущаяВерсияОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнешняяОбработкаКИД, "Версия");
	
		Для Каждого ТекущееОкно Из ПолучитьОкна() Цикл
			Для Каждого Форма Из ТекущееОкно.Содержимое Цикл
				Если ТипЗнч(Форма) <> Тип("УправляемаяФорма") Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрНачинаетсяС(Форма.ИмяФормы, ПолноеИмяОбъекта) Тогда
					РеквизитыФормы = Новый Структура("ВерсияДополнительногоОтчетаИлиОбработки");
					ЗаполнитьЗначенияСвойств(РеквизитыФормы, Форма);
					
					Если ЗначениеЗаполнено(РеквизитыФормы.ВерсияДополнительногоОтчетаИлиОбработки) Тогда
						Если РеквизитыФормы.ВерсияДополнительногоОтчетаИлиОбработки <> ТекущаяВерсияОбъекта Тогда
							ТекущееОкно.Активизировать();
							ПоказатьПредупреждение(, "Версия отчёта изменилась, для повторного запуска закройте все формы отчёта");
							Возврат;
						КонецЕсли;
					Иначе	
						ТекущееОкно.Активизировать();
						ПоказатьПредупреждение(, "Форма отчёта уже открыта, для повторного запуска закройте форму");
						Возврат;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ВнешняяОбработкаКИД);
		
		ОткрытьФорму("ВнешняяОбработка." + ИмяПодключенногоОбъекта + ".Форма", Новый Структура("ИдентификаторРезультата", Запись.Идентификатор));
	
	КонецЕсли; 
	
КонецПроцедуры
